content_org/computer.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Computer Science</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Eason Zhang" />
<link rel="stylesheet" type="text/css" href="../static/css/worg.css"  />
</head>
<body>
<div id="content">
<h1 class="title">Computer Science</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge6ba2e4">1. Computer</a>
<ul>
<li><a href="#org1c026ee">1.1. learn python the hard way</a></li>
</ul>
</li>
<li><a href="#orgde083c1">2. Reference</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge6ba2e4" class="outline-2">
<h2 id="orge6ba2e4"><span class="section-number-2">1</span> Computer</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1c026ee" class="outline-3">
<h3 id="org1c026ee"><span class="section-number-3">1.1</span> learn python the hard way</h3>
<div class="outline-text-3" id="text-1-1">
<p>
For a long time, I have been planning to learn Python. However, because I never
use Python in my work, the plan was delayed again and again. Today, it is
raining cats and dogs outside. Why not do something I have planned long time ago
in this perfect mode? So I picked up the book <i>Learning Python the Hard Way</i> by
Zed Shaw. During the learning, I use Emacs as my Editor, running the programming
on my old Thinkpad with Ubuntu 16.04 and Python3.5. I am going to learn Python
in the hard way. However, I believe it will be the clever and efficient way.
</p>

<p>
Everything goes fine until I am doing exercise 4. The python code is:
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #FD971F;">cars</span> = <span style="color: #AE81FF;">100</span>
<span class="linenr"> 2: </span><span style="color: #FD971F;">space_in_a_car</span> = <span style="color: #AE81FF;">4</span>
<span class="linenr"> 3: </span><span style="color: #FD971F;">drivers</span> = <span style="color: #AE81FF;">30</span>
<span class="linenr"> 4: </span><span style="color: #FD971F;">passengers</span> = <span style="color: #AE81FF;">90</span>
<span class="linenr"> 5: </span><span style="color: #FD971F;">cars_not_driven</span> = cars - drivers
<span class="linenr"> 6: </span><span style="color: #FD971F;">cars_driven</span> = drivers
<span class="linenr"> 7: </span><span style="color: #FD971F;">carpool_capacity</span> = cars_driven * space_in_a_car
<span class="linenr"> 8: </span><span style="color: #FD971F;">average_passengers_per_car</span> = passengers / cars_driven
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"There are"</span>,cars,<span style="color: #E6DB74;">"cars available."</span><span style="color: #AE81FF;">)</span>
<span class="linenr">11: </span><span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"There are only"</span>,drivers,<span style="color: #E6DB74;">"drivers avaiable."</span><span style="color: #AE81FF;">)</span>
<span class="linenr">12: </span><span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"There will be"</span>, cars_not_driven,<span style="color: #E6DB74;">"empty cars today."</span><span style="color: #AE81FF;">)</span>
<span class="linenr">13: </span><span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"We can transport"</span>,carpool_capacity,<span style="color: #E6DB74;">"people today."</span><span style="color: #AE81FF;">)</span>
<span class="linenr">14: </span><span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"We have"</span>,passengers,<span style="color: #E6DB74;">"to carpool today."</span><span style="color: #AE81FF;">)</span>
<span class="linenr">15: </span><span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"We need to put ablout"</span>,average_passengers_per_car,<span style="color: #E6DB74;">"in each car"</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<pre class="example">
There are 100 cars available.
There are only 30 drivers avaiable.
There will be 70 empty cars today.
We can transport 120 people today.
We have 90 to carpool today.
We need to put ablout 3.0 in each car

</pre>


<p>
and the result is shown belowing the code.
</p>

<p>
Notice that in the source, the first line concerning print is:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"There are"</span>,cars,<span style="color: #E6DB74;">"cars available."</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
instead of
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"There are "</span>,cars,<span style="color: #E6DB74;">" cars available."</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
Notice the difference? the whitespace. In Python, the whitespace is inserted
around the results automatically which is kind of a surprise for a programmer
familiar with <code>C/C++</code> .
</p>
</div>
</div>
</div>









<div id="outline-container-orgde083c1" class="outline-2">
<h2 id="orgde083c1"><span class="section-number-2">2</span> Reference</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="~/zorg/research_library/zcl.bib">~/zorg/research_library/zcl.bib</a>

</p>
</div>
</div>
</div>
</body>
</html>
